'''
給定一個奇數整數 n，產生一個大小為（n×n）的二維陣列。
然後在中間行、中間列和對角線中填入 1，其他位置用 0 填充。
請印出每一列，並將二維陣列回傳。
 n = 1 
 [1]
 
 [[1]]

 n = 3
 [1, 1, 1]
 [1, 1, 1]
 [1, 1, 1]
 
 [[1, 1, 1], [1, 1, 1], [1, 1, 1]]

 n = 5
 [1, 0, 1, 0, 1]
 [0, 1, 1, 1, 0]
 [1, 1, 1, 1, 1]
 [0, 1, 1, 1, 0]
 [1, 0, 1, 0, 1]
 
 [1, 0, 1, 0, 1], [0, 1, 1, 1, 0], [1, 1, 1, 1, 1], [0, 1, 1, 1, 0], [1, 0, 1, 0, 1]]
'''

def problem5(n):
  ans = []
  for i in range(n):
    row =[]
    for j in range(n):
     pass
    ans.append(row)     
  return ans

print(f"\n{problem5(5)}")